### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖Success! The configuration is valid.


#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_dynamodb_table.idol_table will be created
  + resource "aws_dynamodb_table" "idol_table" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "IdolType"
      + id               = (known after apply)
      + name             = "idolGroupList"
      + range_key        = "IdolName"
      + read_capacity    = (known after apply)
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags_all         = (known after apply)
      + write_capacity   = (known after apply)

      + attribute {
          + name = "IdolName"
          + type = "S"
        }
      + attribute {
          + name = "IdolType"
          + type = "S"
        }
      + attribute {
          + name = "UserDefinedIdolCategory"
          + type = "S"
        }

      + global_secondary_index {
          + hash_key           = "IdolName"
          + name               = "getByIdolName"
          + non_key_attributes = [
              + "getByUserDefinedCategory",
              + "spotifyApiUrl",
              + "spotifyClientUrl",
              + "spotifyId",
            ]
          + projection_type    = "INCLUDE"
        }
      + global_secondary_index {
          + hash_key           = "UserDefinedIdolCategory"
          + name               = "getByUserDefinedCategory"
          + non_key_attributes = [
              + "IdolName",
              + "spotifyApiUrl",
              + "spotifyClientUrl",
              + "spotifyId",
            ]
          + projection_type    = "INCLUDE"
        }

      + point_in_time_recovery {
          + enabled = (known after apply)
        }

      + server_side_encryption {
          + enabled     = (known after apply)
          + kms_key_arn = (known after apply)
        }

      + ttl {
          + attribute_name = (known after apply)
          + enabled        = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @irofessional, Action: `pull_request`, Workflow: `Terraform plan`*